#ifndef _RGSTOCKAPI_H
#define _RGSTOCKAPI_H

#define EXIT_STOCK   0xF0    //退出时的返回值

//********************************************************************
//函数功能:定时刷新
//输出参数: 
//返回值:
//********************************************************************

extern void   RGUpdataTimer(void);

//********************************************************************
//函数功能:股票入口
//输出参数: 
//返回值:成功返回0,失败返回-1
//********************************************************************

extern	int		stock_main( void );

//********************************************************************
//函数功能:键值处理
//输入参数:键值
//返回值:成功返回0,失败返回-1
//********************************************************************

extern	int		_process_keys( int );



typedef const unsigned char * pImageData;

//********************************************************************
//函数功能:获取图片地址
//输入参数: menu
//          banner
//返回值:成功返回0,失败返回-1
//********************************************************************

extern  int   GetStockResAddr(pImageData ,pImageData,pImageData,pImageData,pImageData);


//********************************************************************
//函数功能:更改5种颜色值
//
// @param   T_U32 red:价格上涨(Rise)的颜色
// @param   T_U32 green:价格下跌(Drop)的颜色
// @param   T_U32 blue:激活按钮的颜色
// @param   T_U32 yellow:弹出菜单光标条, 主信息和均线2的颜色。
// @param   T_U32 skyblue:成交量的颜色
//
//返回值:成功返回0,失败返回-1
//********************************************************************
extern int RG_modifyRGBColor(T_U32, T_U32, T_U32, T_U32, T_U32);


//********************************************************************
//函数功能:判断退出区域的接口
//输入参数: 坐标值(x,y)
//          
//返回值:退出程序返回1，其他返回0
//********************************************************************

extern  int ispointinreturn(int,int);



//********************************************************************
//函数功能:判断退出的接口
//输入参数: 
//          
//返回值:退出程序返回1，其他返回0
//********************************************************************
extern int isDialog_StockEixt(void);



//********************************************************************
//函数功能:suspend时保存屏幕
//输入参数: 
//          
//返回值:
//********************************************************************
extern void RGStock_Suspend(void);



//********************************************************************
//函数功能:恢复屏幕
//输入参数: 
//          
//返回值:
//********************************************************************
extern void RGStock_Rusume(void);



//********************************************************************
//函数功能:系统异常退出接口:不保存文件
//输入参数: 
//          
//返回值:
//********************************************************************
extern void	stock_quit_Ex(void);

#endif